share/tutorials/incompressible/dym-pimple/mixer_vessel_ami_2d/constant/turbulenceProperties
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "constant";
  object      turbulenceProperties;
}

simulationType  laminar;

// vim: set ft=foam et sw=2 ts=2 sts=2:
