share/tutorials/incompressible/dym-pimple/mixer_vessel_ami_2d/system/fvSolution
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "system";
  object      fvSolution;
}

solvers
{
  pcorr
  {
    solver          GAMG;
    smoother        GaussSeidel;
    nPreSweeps      0;
    nPostSweeps     2;
    cacheAgglomeration off;
    agglomerator    faceAreaPair;
    nCellsInCoarsestLevel 10;
    mergeLevels      1;
    tolerance        0.02;
    relTol           0;
  }
  p
  {
    $pcorr;
    tolerance       1e-06;
    relTol          0.01;
  }
  pFinal
  {
    $p;
    tolerance       1e-06;
    relTol          0;
  }
  U
  {
    solver          smoothSolver;
    smoother        GaussSeidel;
    tolerance       1e-05;
    relTol          0.01;
  }
  UFinal
  {
    $U;
    tolerance       1e-06;
    relTol          0;
  }
  cellMotionUx
  {
    solver          PCG;
    preconditioner  DIC;
    tolerance       1e-08;
    relTol          0;
  }
}
PIMPLE
{
  correctPhi          yes;
  nOuterCorrectors    2;
  nCorrectors         1;
  nNonOrthogonalCorrectors 0;
  pRefCell            0;
  pRefValue           0;
}
relaxationFactors
{
  equations
  {
    "U.*"           1;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
