share/tutorials/incompressible/dym-pimple/mixer_vessel_ami_2d/system/decomposeParDict
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "system";
  object      decomposeParDict;
}

//- Force AMI to be on single processor. Can cause imbalance with some
//  decomposers.
//singleProcessorFaceSets ((AMI -1));
numberOfSubdomains 4;
method          scotch;
distributed     no;
roots           ( );

// vim: set ft=foam et sw=2 ts=2 sts=2:
