share/tutorials/incompressible/dym-pimple/mixer_vessel_ami_2d/system/topoSetDict
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      topoSetDict;
}

actions
(
  // Get both sides of ami
  // ~~~~~~~~~~~~~~~~~~~~~
  // Get all faces in cellSet
  {
    name    AMI;
    type    faceSet;
    action  new;
    source  patchToFace;
    sourceInfo
    {
      name "AMI.*";
    }
  }
);

// vim: set ft=foam et sw=2 ts=2 sts=2:
